from flask import Flask, render_template, request, jsonify
import difflib

app = Flask(__name__)

# قاعدة بيانات للأسئلة والإجابات
responses = {
    "ازاي اسجل المواد؟": " قم بتسجيل الدخول ومن الملف الشخصر قم بالضغط على تسجيل المقررات واختيار المواد التر ترغب فى تسجيلها ومن ثم قم بطباعة الاستماره والتوجه الى خزينة الكليه .",
    "معلومات عن الكليه ":" يمكنك الاطلاع على جميع المعلومات من خلال صفحة عن الكليه ",
    "البريد الجامعي ": "من خلال صفحة عن الكليه اضغط على ايقونه الحصول على البريد الجامعي ",
    "الحصول على الكتب":"يمكتك الحصول على الكتب من حلال تسجيل الدخول ",
    "المرشد الاكاديمي ":"يمكنك طلب المشورة من خلال  الضغط على ايقونه 'ارشاد اكاديمي شخصي ' اسفل الصفحى الرئيسيه",
    "الارشاد الاكاديمي ":"يمكنك طلب المشورة من خلال  الضغط على ايقونه 'ارشاد اكاديمي شخصي ' اسفل الصفحى الرئيسيه",
    " ازاى اتواصل مع مرشدي الاكاديمي":"يمكنك طلب المشورة من خلال  الضغط على ايقونه 'ارشاد اكاديمي شخصي ' اسفل الصفحى الرئيسيه",
    "الكتب الدراسيه ":"يمكنك الحصول على الكتب بعد القيام بتسجيل المقررات من خلال الضغط على الكتب من الملف الشخصي",
    "مذاكرة المقررات":"يمكنك الحصول على الكتب بعد القيام بتسجيل المقررات من خلال الضغط على الكتب الدراسيه من الملف الشخصي",
    "المعدل التراكمي ":"قم بتسجيل الدخول ومن الملف الشخصي  قم بالضغط علي المعدل التراكمي ",
    "حساب الدرجات ":"قم بتسجيل الدخول ومن الملف الشخصي  قم بالضغط علي المعدل التراكمي",
    "ازاى احسب درجاتي ":"قم بتسجيل الدخول ومن الملف الشخصي  قم بالضغط علي المعدل التراكمي",
    "احتيار الاقسام ":" يمكنك التعرف على اقسام الكليه والمميزات والعيوب من خلال صفحة عن الكليه ",
    "الجدول":"هفى الملف الشخصي من خلال الضغط على الجداول الدراسي",
    "الجداول":"فى الملف الشخصي من خلال الضغط على الجداول الدراسيه",
    "جدول المحاضرات ":"فى الملف الشخصي من خلال الضغط على الجداول الدراسيه ",
    "أيام الحضور":"قم بتسجيل الدخول والضغط على الجداول الدراسيه من الملف الشخصي",
    "حساب تقديري ":"قم بتسجيل الدخول ومن الملف الشخصي  قم بالضغط علي المعدل التراكمي"
}
def get_best_match(user_message):
    best_match = difflib.get_close_matches(user_message, responses.keys(), n=1, cutoff=0.5)
    if best_match:
        return responses[best_match[0]]
    else:
        return "ممكن توضحلي سؤالك أكتر؟"

# صفحة رئيسية
@app.route("/")
def home():
    return render_template("chatbot.html")

# API للرد
@app.route("/get", methods=["POST"])
def get_bot_response():
    user_message = request.json["message"].lower().strip()

    if any('a' <= c <= 'z' for c in user_message):
        bot_response = "من فضلك اكتب سؤالك باللغة العربية فقط."
    elif any(word in user_message for word in ["انا", "اهلا", "مرحبا", "ازاي", "عامل ايه", "هاي"]):
        bot_response = "اهلا انا بوت تكنو، كيف يمكنني مساعدتك؟"
    else:
        bot_response = get_best_match(user_message)

    return jsonify({"response": bot_response})

# تعديل الهيدر
@app.after_request
def add_header(response):
    response.headers["X-UA-Compatible"] = "IE=edge"
    return response

# تشغيل التطبيق
if __name__ == "__main__":
    app.run(host="0.0.0.0", port=5000)